<a href="https://colab.research.google.com/github/Dharmatej183/Dharmatej183/blob/main/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Importing the required libraries 

import pandas as pd
import numpy as np

Info provided by the AAIC Team to solve the assignment Consider the following Python dictionary data and Python list labels:

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [2]:
# Create a DataFrame birds from this dictionary data which has the index labels 

# Loading the dictionary data and the labels series 

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
# checking the type of data sctructure 
type(data)

dict

In [4]:
# checking the type of data sctructure 
type(labels)

list

In [17]:
# Converting the dictionary into DataFrame
birds = pd.DataFrame(data)

In [18]:
# Checking the Top 5 rows 
birds.head()

        birds  age  visits priority
0      Cranes  3.5       2      yes
1      Cranes  4.0       4      yes
2     plovers  1.5       3       no
3  spoonbills  NaN       4      yes
4  spoonbills  6.0       3       no

In [19]:
# Checking the number of rows and colums in the Data Frame 
birds.shape

(10, 4)

In [20]:
# Checking the current index of the data frame 
birds.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
# Converting the current index into the elements in the label series as per the requirement 

birds.index = labels

birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

# 2.  Display a summary of the basic information about birds DataFrame and its data.

In [24]:
# 2.a checking the size of the data frame

birds.shape

(10, 4)

In [25]:
# 2.b Checking the summary  of the data frame 
birds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [26]:
# 2.c Checking the number of null values in each column 
birds.isnull().sum()

birds       0
age         2
visits      0
priority    0
dtype: int64

# 3. Print the first 2 rows of the birds dataframe

In [27]:
birds.iloc[:2]

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

# **4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [28]:
birds.iloc[:,:2]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

# 5 . select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']

In [30]:
birds.iloc[[2,3,7],[1,2,3]]

   age  visits priority
c  1.5       3       no
d  NaN       4      yes
h  NaN       2      yes

# 6. select the rows where the number of visits is less than 4**

In [31]:
birds[birds['visits'] < 4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

# 7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN

In [33]:
birds[birds['age'].isnull()].iloc[:,:3]

        birds  age  visits
d  spoonbills  NaN       4
h      Cranes  NaN       2

# 8 .Select the rows where the birds is a Cranes and the age is less than 4

In [34]:
birds[(birds['birds']=='Cranes') & (df['age'] < 4)]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

# 9. Select the rows the age is between 2 and 4(inclusive)**

In [35]:
birds[birds['age'].between(2,4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

# 10. Find the total number of visits of the bird Cranes

In [36]:
birds[birds['birds']=='Cranes']['visits'].sum()

12

# 11 . Calculate the mean age for each different birds in dataframe.

In [37]:
birds[['birds','age']].groupby(['birds']).mean()

            age
birds
Cranes      3.5
plovers     3.5
spoonbills  6.0

# 12 . Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.

In [38]:
# adding a row using loc function 

k = pd.DataFrame({'birds':'parrot', 'age':6.0, 'visits':3, 'priority': 'yes'}, index=['k'])
birds = birds.append(k)
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k      parrot  6.0       3      yes

In [39]:
# Deleting the created row using drop 
# Here we are using inplace = true so that the perfromed operation should be  permanant
birds.drop(index='k', inplace=True)
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

# 13 Find the number of each type of birds in dataframe (Counts)

In [41]:
birds.groupby(['birds']).size()

birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

# 14 . Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascen

In [42]:
# sorting the dataframe by the values of age in decending order

df.sort_values(['age'],ascending=False)

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
b      Cranes  4.0       4      yes
j  spoonbills  4.0       2       no
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
h      Cranes  NaN       2      yes

In [43]:
# sorting the dataframe by the values of visits in ascending order

df.sort_values(['visits'])

        birds  age  visits priority
a      Cranes  3.5       2      yes
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
j  spoonbills  4.0       2       no
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
i  spoonbills  8.0       3       no
b      Cranes  4.0       4      yes
d  spoonbills  NaN       4      yes
f      Cranes  3.0       4       no

# 15. Replace the priority column values with'yes' should be 1 and 'no' should be 0

In [44]:
# using Deep copy method so that the original data frame would not be afftected

df1 = birds.copy(deep=True)

In [46]:
df1['priority'] = df['priority'].replace(['yes','no'],[1,0])
df1

        birds  age  visits  priority
a      Cranes  3.5       2         1
b      Cranes  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f      Cranes  3.0       4         0
g     plovers  5.5       2         0
h      Cranes  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0

16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'

In [47]:
# using Deep copy method so that the original data frame would not be afftected

df2 = birds.copy(deep=True)

In [49]:
df2['birds'] = df['birds'].replace(['Cranes'],[ 'trumpeters'])

df2

        birds  age  visits priority
a  trumpeters  3.5       2      yes
b  trumpeters  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f  trumpeters  3.0       4       no
g     plovers  5.5       2       no
h  trumpeters  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no